app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`user_name` = 'adam') LIMIT 1
---
  def find
    @user = User.authenticate(params[:user_name], params[:password])
    logger.debug("UsersController.find: @user[#{@user}]")

INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`, `user_name`, `authority`, `last_login_at`, `born_on`) VALUES('fred flintstone', 'QjZDlyfzPVk=', '2010-09-23 19:57:08', '2010-09-23 19:57:08', '295a1bfa47a980ffa939a3a8aac2d15612da5917b6af2233aa2f86cd36a21155', 'fred', NULL, NULL, NULL)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 134452246)
UPDATE `users` SET `updated_at` = '2010-09-23 19:57:08', `name` = 'quinn thomas lawrence' WHERE `id` = 134452246
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])